Pandas is a powerful data manipulation library in python, widely used for data analysis and data cleaning. It provides two primary data structures : series and data frame. A series is one dimensional array like object, while data frame is a two dimensional, size mutable and potentially heterogeneous tabular.

In [1]:
import pandas as pd

In [2]:
## Series in pandas
import pandas as pd
data = [1,2,3,4,5]
series = pd.Series(data)
print("Series:\n",series)
print(type(series))

Series:
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [15]:
## Create series from dictionary
data = {'a':1,'b':2,'c':3,'d':4,'e':5}
series_dict = pd.Series(data)
print(series_dict)
print(type(series_dict))

a    1
b    2
c    3
d    4
e    5
dtype: int64
<class 'pandas.core.series.Series'>

In [4]:
data = [10,20,30,40,50]
index = ['a','b','c','d','e']
series = pd.Series(data,index)
print(series)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [5]:
#DataFrame
# Create a dataframe from a dictionary of list

data = {
    'Name':['MUHAMMAD','Imtiaz','Ahmed'],
    'Age':[22,24,27],
    'City':['Dhaka','Chittagong','Sylhet']
}

#Now create a data frame
df = pd.DataFrame(data)
print(df)
print(type(df))

       Name  Age        City
0  MUHAMMAD   22       Dhaka
1    Imtiaz   24  Chittagong
2     Ahmed   27      Sylhet
<class 'pandas.core.frame.DataFrame'>

In [6]:
import numpy as np
np.array(df)  #Convert dict to array

array([['MUHAMMAD', 22, 'Dhaka'],
       ['Imtiaz', 24, 'Chittagong'],
       ['Ahmed', 27, 'Sylhet']], dtype=object)

In [7]:
#Create  a dataframe from the list of Dictionaries

data = [
    {'Name': 'Muhammad','Age':24,"City":"Dhaka"},
    {"Name":"Ahmed","Age":26,"City":"Chandpur"},
    {"Name":"Imtiaz","Age":28,"City":"Chittagong"}
]
df = pd.DataFrame(data)
print(df)

       Name  Age        City
0  Muhammad   24       Dhaka
1     Ahmed   26    Chandpur
2    Imtiaz   28  Chittagong

In [ ]:
#Read a data frame from excel or csv file
df = pd.read_csv('data.csv')
df.head(9) #Print first 9 records

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North
5  2023-01-06        B   54.0  Product3  192.0   West
6  2023-01-07        A   16.0  Product1  936.0   East
7  2023-01-08        C   89.0  Product1  488.0   West
8  2023-01-09        C   37.0  Product3  772.0   West

In [12]:
df.tail(5) #Print last 5 records

          Date Category  Value   Product  Sales Region
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

In [20]:
df.head(10)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North
5  2023-01-06        B   54.0  Product3  192.0   West
6  2023-01-07        A   16.0  Product1  936.0   East
7  2023-01-08        C   89.0  Product1  488.0   West
8  2023-01-09        C   37.0  Product3  772.0   West
9  2023-01-10        A   22.0  Product2  834.0   West

In [ ]:
df.head(5)['Sales'] #Call the data by column wise

0    754.0
1    110.0
2    398.0
3    522.0
4    869.0
Name: Sales, dtype: float64

In [ ]:
df.loc[3] #Call data by row

Date        2023-01-04
Category             B
Value              8.0
Product       Product1
Sales            522.0
Region            East
Name: 3, dtype: object

In [ ]:
df.iloc[1][5] #Index wise integer num call

C:\Users\ASUS\AppData\Local\Temp\ipykernel_8064\467497172.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[1][5]

'North'

In [31]:
#Accessing specific element
df.head(5)['Date']

0    2023-01-01
1    2023-01-02
2    2023-01-03
3    2023-01-04
4    2023-01-05
Name: Date, dtype: object